---
kind: type
id: T:Autodesk.Revit.DB.LevelAssociationData
source: html/f5cae466-48f8-7dfe-a9e4-4aede0db27a3.htm
---
# Autodesk.Revit.DB.LevelAssociationData

This class holds information related to Level.

## Syntax (C#)
```csharp
public class LevelAssociationData : IDisposable
```